<?php
return [
	//00 系统错误
	'E-010001' => '必须使用异步请求该方法',
	'E-010002' => '请求类型必须为POST',
	
	//02用户模块
	'E-010201' => '用户名或密码不能为空',
	'E-010202' => '用户名或密码错误', //用户名不存在
	'E-010203' => '用户名或密码错误', //密码错误
	'E-010204' => '没有查询到用户',
	
	//03文章模块错误
	'E-030101' => '编号：{:id}文章不存在，请核对后重试！',
	//'E-030102' => '文章提交方式错误',
	'E-030103' => '文章标题不能为空',
	'E-030104' => 'MarkDown不能为空',
	'E-030105' => '文章详细内容不能为空',
	'E-030106' => '分页数必须存在且为十进制整数',
		
	'E-030201' => '没有查询到文章',
		
	'E-030301' => '文章创建失败',
		
	'E-030401' => '文章更新失败',
		
	'E-030501' => '文章删除失败',
		
	//04资源模块错误
];