<?php
return [
	//01 系统错误
	
	//02用户模块错误
	'E-020101' => '用户名或密码不能为空',
	'E-020102' => '登录提交类型错误',
	'E-020103' => '用户名或密码错误',
	'E-020104' => '用户名或密码错误',
	
	//03文章模块错误
	'E-030101' => '编号：{:id}文章不存在，请核对后重试！',
	//'E-030102' => '文章提交方式错误',
	'E-030103' => '文章标题不能为空',
	'E-030104' => 'MarkDown不能为空',
	'E-030105' => '文章详细内容不能为空',
	'E-030106' => '分页数必须存在且为十进制整数',
		
	'E-030201' => '没有查询到文章',
		
	'E-030301' => '文章创建失败',
		
	'E-030401' => '文章更新失败',
		
	'E-030501' => '文章删除失败',
		
	//04资源模块错误
];